# ExternalCommandData Properties

---
The ExternalCommandData type exposes the following members.
| Name| Description
---|---|---
| Application|  Retrieves an object that represents the current Application for external command.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| JournalData| A data map that can be used to read and write data to the Autodesk Revit journal file.
| View|  Retrieves an object that represents the View external command work on.
Top
#### Reference
ExternalCommandData Class
Autodesk.Revit.UI Namespace